$(document).ready(function () {
    const artists = {
        SalvadorDali:{
            name: 'Салвадор Дали',
            button: 'SalvadorDali',
            image: 'SalvadorDali.jpeg',
            description:
            'Салвадор Дали, рођен 11. маја 1904. године у Фигуересу, Каталонија, Шпанија, био је један од најекстравагантнијих, контроверзних и утицајних уметника 20. века. Његово име постало је синоним за надреализам, уметнички покрет који је истраживао подсвест и ирационалне аспекте људског ума. Дали је био изузетно талентован сликар и вајар, али је такође експериментисао и у другим уметничким медијима, попут фотографије, филмова, књига, костимографије и сценографије. Његове слике су пуне симболизма, а често су приказивале бизарну комбинацију предмета, често сведених на надреалистичке пејзаже и снове. Његова дела су обиљежена прецизном техником и детаљима, често уз коришћење танких слојева боје и реалистичне прецизности. Иако је Дали постао познат по свом уметничком раду, био је такође познат и по свом екстравагантном понашању. Он је био велики ексцентрик, увек обучен у необичне одец́е, а карактеристичан детаљ био је његов упадљиви пар дугих бркова. Његова појава, заједно са његовим харизматичним и провокативним ставом, помогла је да га свет препозна и запамти. Дали је био дубоко инспирисан теоријом психолога Сигмунда Фројда о подсвести и сновима. Веровао је да је уметност мост између свесног и подсвесног ума, и да је кроз уметност могуц́е истраживати и изразити оно што је скривено испод површине. Његова дела често приказују фантастичне сцене које изазивају размишљање и постављају питања о природи стварности. Током своје каријере, Дали је сарађивао са многим другим уметницима, писцима, редитељима и музичарима. Био је део покрета надреализма, заједно са сликарима као што су Рене Магритте и Маџ Ернст, и постао је један од најпрепознатљивијих представника тог покрета. Његова дела су излагана широм света и освојила су бројне награде и признања. Кроз своју уметност, Дали је истраживао и изазивао конвенционалне идеје о уметности и стварности. Био је креативна сила која је унапредила границе уметности и инспирисала генерације уметника након њега. Његов утицај на свет уметности сеже и даље од сликарства, јер је његова визија и филозофија постала инспирација за филмску индустрију, моду, дизајн и популарну културу уопште. Салвадор Дали је преминуо 23. јануара 1989. године, али његово наслеђе живи и наставља да инспирише и одушевљава људе широм света. Његова неоспорна генијалност, маштовитост и ексцентричност чине га једним од најистакнутијих уметника модерног доба, а његове слике и идеје остају као тестамент његовом изузетном таленту и визионарству.',
        },
        HieronymusBosch:{
            name: 'Хијероним Бош',
            button: 'HieronymusBosch',
            image: 'HieronymusBosch.jpeg',
            description:
            'Хиеронyмус Босцх био је северноевропски сликар касног средњег века. Његов рад има упечатљиву и понекад наизглед надреалну иконографију. Босцх је насликао неколико триптиха великих размера, укључујући "Врт земаљских ужитака" (око 1510.-15.). Током своје каријере користио је своју уметност да би приказао грехе и лудости човечанства и показао последице тих поступака. Умро је у Хертогенбосцху 1516. Говорити о Бошовом стваралаштву захтева не само уобичајено знање, него праву ренесансну ерудицију. Да би се правилно тумачило његово сликарство неопходно је одлично познавање хришћанства, касног средњег века, тадашњих теолошких питања, апокрифних књига, народних приповести, езотерике, астрологије, алхемије, сликарства, вајарства, католичке и православне иконографије... Мало ко уједњује сва ова знања у данашње време специјализација, те Бошове слике и даље остају прилично тајновите.Због обиља детаља, у Бошовим композицијама није могуће једним погледом обухватити читаву сцену. Врло дуго, обични посматрачи, али и академски стручњаци, у његовим делима видели су само сатиричну страну и у потпуности занемаривали духовну и моралну. За правилно разумевање холандског мајстора, неопходно је узети у обзир историјски контекст, потом визуелну културу и теолошко образовање мајстора. Сложеност духа великог Холанђанина, надахнутог пре свега хришћанством, али и астрологијом и алхемијом, морало би да буде сагледано на више нивоа.Скоро у свим Бошовим композицијама појављују се овоидни облици налик јајима или очима, симболични кључеви који указују на догађања у спољашњем свету и њихове вредности у унутрашњем свету. Очигледна је жеља сликара да успостави односе између ока и духа, између визуелног и концептуалног. Зато можемо да закључимо да Бошова дела, сачињена од самих симбола, имају за циљ да буду основа за дискусију. Намењена образованим гледаоцима, она позивају на медитацију о људском животу, али, истовремено, она помажу гледаоцу да заузме став, да критикује појаве и да раздвоји истину од лажи, указујући на личну одговорност сваке особе на путу ка спасењу.Порука Бошовог целокупног стваралаштва наликује симболу путујућег трговца, на вратима затвореног триптиха Кола сена, показујући да човечанство може да напредује, под условом да буде пажљиво и да заобилази искушења. Ништа није изгубљено унапред, ако се пази и ако је човек свестан својих дела.',
        },
        GustavKlimt: {
            name: 'Густав Климт',
            button: 'GustavKlimt',
            image: 'GustavKlimt.jpeg',
            description:
            'Рођен је 1862. године у породици скромних могућности. Уз помоћ стипендије марљивим радом брзо је напредовао у бечкој Школи за уметност. Поред послова украшавања плафона и театара успешно је радио портрете добростојећих јеврејских породица. У сарадњи са архитектима осмишјавао је читаве куће и виле као „тотална уметничка дела“. Када је 1894. добио наруџбину за три слике на плафону великог бечког универзитета, због оригиналног алегоријског приказа правног, медицинског и филозофског факултета изазвао је скандал. За лицемерни Беч било је ту превише голотиње. „Проблем је био што је Климт показао Бечлијама како они сами изгледају. Наге жене није сликао као богиње, већ као обичне жене из суседства. Сликао их је у њиховој лепоти, али и ружноћи“ , каже историчар уметности Алфред Вајдингер. Све се то нашло на плафонима конзервативног Универзитета. „Била је то кап која је прелила чашу. Али није се радило о смишљеној провокацији. Климт је био врло аутентичан, једноставно је желео да слика оно што га је забављало“. Радове из Универзитета у Бечу касније је уз помоћ своји мецена откупио. Већ тада су коштали читаво богатство. Данас се они могу видети само на репродукцијама. Оригинали су запаљени од стране нациста крајем Другог светског рата. Једно од његових најпознатијих дела је портрет Аделе Блох-Баурер. Пореклом Јеврејка, тада је имала 26 година. Била је ћерка директора Бечког удружења банака и супруга Фердинанда Блоха, власника више фабрика шећера по Европи. У салону Аделе и Фердинанда сакупљали су се уметници, писци, социјалдемократи, а међу њима је био и Густав Климт. Породица је од уметника наручила портрет Аделе и купила још 6 слика. Чудну судбину доживела је ова слика укључујући и спектакуларно суђење против две моћне државе, Аустрије и САД-а. „Жена у злату“ из 2015. године је филмско остварење ове приче. „Он није био академски сликар. Није посећивао сликарске академије, него школе за уметност. С класичним сликарством није имао ништа. Користио је велики број материјала којима се бавио још од свог школовања. То је био уметнички обрт. Управо те „материјалне слике“ чине Климта посебним“. Климт је био „декоративни уметник“ али начин на који је сликао код људи изазива побожност. „То увек изнова уочавам“, истиче Вајдингер. Посебно поглавље историје уметности представља Климтов однос према женама. Увек их је приказивао бојама и облицима. Живео је у полугамилији што је доносило љутњу и стрес. То се види из бројних писама која су остала после њега. Никада се није женио – његова страст је била сликарство. Нико не зна колико је деце имао. Након његове смрти 14 њих је поднело захтев за наследством. Четворо је званично признато. „Једноставно је био згодан тип, што је видљиво и на фотографијама“, каже историчар уметности Алфред Вајдингер. Густав Климт је умро 6. фебруара 1918. од последица можданог удара.',
        },
        FranciscoGoya: {
            name: 'Франциско Гоја',
            button: 'FranciscoGoya',
            image: 'FranciscoGoya.jpeg',
            description:
            'Франциско Гоја, шпански сликар, цртач и графичар који је остао познат као један од највећих уметника свог доба и као инспирација уметницима преминуо је 16. априла 1828. године. Био је последњи мајстор старе уметности и отац модерне уметности. Гоја је 1786. почео да ради као дворски сликар на шпанском двору, где је сликао портрете аристократије и краљевске породице, као и таписерије за краљевску палату. У овом периоду његовог стваралаштва видео се утицај рококо стила на његову уметност. Након озбиљне болести која га је оставила глувим 1793. Гојина уметност опостаје знатно мрачнија, одражавајући његов унутрашњи свет. Када је 1807. Наполеон повео војску на Шпанију, Гоја је остао у Мадриду и бележио догађаје у својој серији отисака „Ужаси рата“.  Његова можда најпознатија слика, „3.мај 1808. Погубљење бранилаца Мадрида“ насликана је неколико година након рата. Ова слика има карактеристике импресионизма, правца на који је Гојино стваралаштво значајно утицало. Дело „Нага Маја“ за тај период у Европи било је скандалозно јер су већина слика на којима је приказивано наго тело биле  инспирисане митологијом или изражене кроз алегорију. Гоја је био први уметник који је насликао голу жену у реалистичном стилу, што је представљало велико одступање од традиције. Постоји и друга верзија ове слике у којој је жена одевена. Обе слике конфисковала је Шпанкска инквизиција 1813. године.Гоја је био је инспирација уметницима модерног и пост-модерног доба, његова „Нага Маја“ инспирисала је Манеа да наслика „Олимпију“ 1863. године, док се Пикасо јавно дивио његовим графикама које приказују борбе са биковима. Уметник се повукао са места дворског сликара када му се здравље знатно погоршало, а када је политичко стање у Шпанији постало крајње нестабилно, избегао је у Француску, у Бордо, где је и преминуо  16. априла 1828.',
        },
        DiegoVelazquez: {
            name: 'Дијего Веласкез',
            button: 'DiegoVelazquez',
            image: 'DiegoVelazquez.jpeg',
            description:
                'Дијего Родригез де Силва Веласкез (1599-1660), родио се у Севиљи, тада, једном од најбогатијих градова Европе. Било му је само једанаест година када је примљен у атеље Ф. Пачекоа, познатог сликара и теоретичара уметности. Ту је, поред сликања, стекао широко образовање и имао прилику да се упозна са многим значајним уметницима, песницима и књижевницима. У овој, за младог сликара врло повољној средини, Веласкез је брзо напредовао.Са деветнаест година насликао је ремек-дело „Старица која пржи јаја“, а следеће године и „Продавца воде“, те се већ са тим младалачким остварењима уврстио међу водеће сликаре. У овим жанр сценама, у то време врло популарним сликарским темама, Веласкез није поштовао конвенције савременог стила јер приказује обичне људе и обичне предмете које слика са великом прецизношћу, хватајући сваки детаљ, од глазуре на керамичком бокалу, одсјаја светла на металним посудама до напола печеног беланцета које у тигању пржи стара куварица.У потрази за правом афирмацијом која се могла начинити само у префињеној атмосфери културног живота престонице, Веласкез је 1622. године посетио Мадрид. И овде је његово сликарство наишло на велика признања, те је следеће године ангажован да изради портрет младог краља Филипа IV. Поверени задатак обавио је тако успешно да одмах добија и позив да постане главни дворски сликар. Од тог тренутка, само је Веласкезу било дозвољено да слика краља Шпаније, најмоћније земље у то доба. Живот и рад на двору представљали су за младог сликара могућност да се усаврши, студирајући мајсторе ренесансног сликарства којима је обиловала краљева колекција. Уметников привилеговани положај омогућавао је Веласкезу да на тим портретима развије неформални стил, приказујући краљевску породицу у разним приликама, што, иначе, крута дворска етикеција није дозвољавала. Веран својим уметничким убеђењима, Веласкез и у овим делима жели, првенствено, да наслика истините ликове. Поред портрета, Веласкез се бавио и сликањем других тема: историјских догађаја, религиозних и митолошких композиција као и једини женски акт „Венера пред огледалом“, који представља једну од најчувенијих слика нагог женског тела у историји сликарства, уопште.Гоја је био је инспирација уметницима модерног и пост-модерног доба, његова „Нага Маја“ инспирисала је Манеа да наслика „Олимпију“ 1863. године, док се Пикасо јавно дивио његовим графикама које приказују борбе са биковима. Уметник се повукао са места дворског сликара када му се здравље знатно погоршало, а када је политичко стање у Шпанији постало крајње нестабилно, избегао је у Француску, у Бордо, где је и 16. априла 1828.Веласкез је имао своје следбенике и у модерној уметности. Његова узбудљива техника сликања као ветром нанесених, брзих потеза четком, услед чега се на тим сликама намера уметника препознаје и постаје јасна тек када се посматра са дистанце, тај његов лични, јединствени стил постао је прототип начина сликања који су „открили“ импресионисти две стотине година касније. Едуард Мане, родоначелник импресионизма, сликарског правца из друге половине деветнаестог века, директно се инспирисао овим Веласкезовим слободним наносима боје и назвао га је „сликарем над сликарима“.'
        },
        VincentVanGogh: {
            name: 'Винсент Ван Гог',
            button: 'VincentVanGogh',
            image: 'VincentVanGogh.jpeg',
            description:
                'Винсент ван Гог (Vincent van Gogh, 1853-1890) је био постимпресионистички сликар, холандског порекла. Надалеко познат чувени сликар Ван Гог био је један од тројице највећих сликара и један од најцењенијих уметника уопште, а све те одлике су му приписане много година после његове смрти. За живота Ван Гог није осетио ни трунку почасти које слава доноси са собом. Био је непознат, непризнат, а док је био жив успео је да прода само једну слику. Услед тешког детињства и бројних психичких проблема, Ван Гога је кроз цео живот пратила беда и тешка стања потиштености и душевне тескобе. Винсент ван Гог је сликарством почео да се бави као јако млад, после двадесете године. Није био академски образован, али то се није могло видети на његовим делима. За непуних седамнаест година живота, насликао је око две хиљаде цртежа и слика које су своју популарност стекле тек након смрти уметника. Озбиљнију активност у цртању уметник је почео у 27-ој години, док је у 28-ој почео да слика, па је Ван Гог сликар који се бавио и цртањем и сликањем. Још као мали, у школи је почео да слика воденим бојама, а из тог периода је сачуван само мали број његових радова. Када је у питању стваралаштво које је оставио иза себе многе не оставља равнодушним. Слике Ван Гога су врло препознатљиве широм света. Током свог стварања, Ван Гог је копирао Милеа, Гогена и Лотрека. Креирао је многе самопортрете током живота, те се сматра да је био плодан самопортретиста који је самог себе сликао више од 43 пута у периоду од 1886. до 1889. године. Током последњих недеља свог живота, Ван Гог је насликао много слика, али међу њима није био ниједан самопортрет, већ само и искључиво природа.Многе слике Ван Гога важе за најскупља дела икада продата.',
        },
        FrigaKahlo: {
            name: 'Фрига Кахло',
            button: 'FrigaKahlo',
            image: 'FrigaKahlo.jpeg',
            description:
                'Фрида Кахло, мексичка сликарка, постигла је велику међународну популарност како својим сликама, тако и својим аутентичним изгледом и политичком активношћу. Сликала је живим бојама у стилу који је био под утицајем аутохтоних култура Мексика, али и најпознатијих уметничких праваца у сликарству, као што су реализам, симболизам и надреализам. Тежак живот, несрећан брак, много проведеног времена у болници, натерали су Фриду Кахло да напусти медицину и окрене се сликарству, осликавајући сваки сегмент свог живота и својих осећања. У наставку текста прочитајте зашто је Фрида Кахло уметница непресушне инспирације, како се развијао њен уметнички пут и сазнајте појединости о неким њеним најистакнутијим сликама. “Ја сликам аутопортрете зато што сам често сама, и зато што себе најбоље познајем” – говорила је Фрида Кахло. Њене слике изражавају властиту бол и сексуалност, па не чуди што их карактеришу јарке боје и што су углавном аутопортрети. Након тешке аутобуске несрећа, нико није веровао да ће се Фрида Кахло опоравити. Упркос бројним операцијама, Фрида је спас пронашла у сликарству. У болници и болничком кревету, започињу њени први дани уметничког стваралаштва. Гоја је био је инспирација уметницима модерног и пост-модерног доба, његова „Нага Маја“ инспирисала је Манеа да наслика „Олимпију“ 1863. године, док се Пикасо јавно дивио његовим графикама које приказују борбе са биковима. Уметник се повукао са места дворског сликара када му се здравље знатно погоршало, а када је политичко стање у Шпанији постало крајње нестабилно, избегао је у Француску, у Бордо, где је и преминуо 16. априла 1828. Радови Фриде Кахло били су врло шокантни. Сликала је сопствена искуства, па су њене слике приказивале бол и тежак живот једне жене. Насликала је нешто мање од сто педесет слика, од којих скоро половину чине аутопортрети који садрже лични симболизам допуњен графичким анатомским референцама. Често је на својим сликама имала симболичног мајмуна, јер је он у мексичкој култури представљао симбол жудње, али их је Фрида на својим делима представљала као симбол заштите и нежности. Када је у питању уметница као што је Фрида Кахло слике које је насликала веома су препознатљиве у свету, а у наставку текста смо издвојили неколико слика које су обележиле уметнички пут мексичке уметнице.',
        }

    };

    $(".artist-redirect").click(function(){
        let siteUrl = window.location.href;
        let urlParts = siteUrl.split('/');
        urlParts[urlParts.length - 1] = "artist.html?name=" +$(this).attr("id"); 
        window.location.href = urlParts.join("/");
    });

    initFunc();

    /**
     * ova fja se izvrsava samo kada je ucitana stranica artist.html
     */
    function  initFunc(){
       let urlParts = window.location.pathname.split('/');
       if(urlParts[urlParts.length - 1] == "artist.html") {
            appendElements();
       }
    }

    function getArtistfromURL(){
        let params = new URLSearchParams(window.location.search);
        let key = params.get("name");
        let data = artists[key];
        return data;
    }

    /**
     * dodaje sadrzaj u stranicu artis.html u zavisnosti od umetnika za kojeg zelimo da napravimo stranicu
     */
    function appendElements(){
        let data = getArtistfromURL();
        // postavljanje naslova
        $(".artist#artist-name").text(data.name);
        // postavljanje deskripcije
        $(".artist#artist-description").text(data.description);
        // pravljenje dugmeta
        var button = $('<button>', {
            'class': 'btn artist-all',
            'id': data.button,
            'html': $('<a>', {
              'href': '#',
              'text': 'Погледајте списак свих дела'
            })
        });

        $(".parent-artist-all").empty();
        $(".parent-artist-all").append(button);
        // pravljenje slike
        var image = $('<img>', {
            'src': './assets/img/artists/'+data.image,
            'alt': data.button,
            'class': 'img-fluid'
        });

        $(".parent-artist-img").empty();
        $(".parent-artist-img").append(image);


    }

});